namespace C.Sharp.Fundamental
{
    class Program
    {
        static void Main(string[] args)
        {
            //ابتدا توضیح مختصری در مورد " پلتفرم " میدیم 

            //بعد به این می پردازیم که اصلا " فریم ورک " چیه و  استفاده از اون چه مزایایی داره

            //****************************************************************************************

            /*
             * Platform:
             * بستری هستش که روی سیستم عامل قرار می گیره و امکان ایجاد و اجرای سایر اجزای سیستم رو در چهارچوبی مشخص فراهم می کنه
             * میتوینم برای درک بهتر پلتفرم از واژه ی #خط_تولید استفاده کنیم
            */

            //************

            /*
             * Cross Platform:
             * Cross Platform به برنامه هایی که بتونن روی پلتفرم های متفاوت اجرا بشن میگیم 
             * یعنی این برنامه قابلیت این رو داره تا در  " بستر های مختلف " و یا بهتره بگیم " سیستم عامل های مختلف " اجرا بشه
             */

            //************

            /*
             * Framework:
             * فریم ورک  جز کوچکی از پلتفرم هستش
             * به طور کلی می تونیم "فریم ورک" رو مجموعه ای از ابزار و کتابخونه ها بدونیم که برنامه نویسا میتونن در کد نویسی هاشون ازش استفاده کنن
             * برای درک بهتر " فریم ورک " میتونیم از #مجموعه_قوانین استفاده کنیم
             * :وجود فریم ورک به یک تیم یا محصول کمک میکنه تا موارد زیر رو گارانتی کنه
             * 1.کیفیت محصول
             * شدن.2 Extend قابلیت
             * یعنی شما یه برنامه ای رو طراحی میکنید و تحویل مشتری میدید
             * زمانی که مشتری نیاز به تغییر داشت میتونین تغییرات لازم رو انجام بدین
             * 3.جلوگیری از اشتباهات تکراری
             */

            //************

            /*
             * میتونیم دات نت رو پلتفرم در نظر بگیریم
             * مایکروسافت استفاده میکنه category پلتفرمی که از
             */

            //****************************************************************************************

            /*
             *  به طور کلی ساختار دات نت فریم ورک به دو دسته ی زیر تقسیم میشه
             *  Base Class Library (BCL)
             *  Common Language Runtime (CLR)
             */

            //************

            /*
             *  BCL :
             *  حاوی کلاس ها و اسمبلی های کاربردی از پیش تعریف شده
             *  های مختلف وجود داره namespace قابلیت استفاده ازشون بر اساس
             */

            //************

            /*
             *  CLR :
             *  وظیفه ی اجرای برنامه ها رو به عهده داره و در واقع هسته ی اصلی دات نت هستش
             *  برای درک بهترش می تونیم از کلمه ی #خط_مقدم استفاده کنیم
             */
        }
    }
}
